Repository: Spacebody/Vela
Catalog: Vela/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# support.check.appUpdate.unavailable
source: App updates are unavailable in the current configuration.
zh_hans: 当前配置下无法使用 App 更新。

# support.check.automation.unavailable
source: The signed CLI and Automation Socket are not enabled in this build.
zh_hans: 此构建未启用已签名的 CLI 和自动化套接字。

# support.check.configuration.failed
source: Validation failed.
zh_hans: 验证失败。

# support.check.configuration.missing
source: No configuration is selected.
zh_hans: 未选择配置。

# support.check.configuration.notValidated
source: Not validated in this session.
zh_hans: 本次会话中尚未验证。

# support.check.configuration.validated
source: Validated
zh_hans: 已验证

# support.check.controller.connected
source: Connected on loopback.
zh_hans: 已通过环回地址连接。

# support.check.controller.connecting
source: Connecting
zh_hans: 正在连接

# support.check.controller.disconnected
source: Disconnected while Mihomo is running.
zh_hans: Mihomo 正在运行，但控制器已断开连接。

# support.check.controller.notRequired
source: Not required while stopped.
zh_hans: 停止状态下无需连接。

# support.check.controller.title
source: Controller
zh_hans: 控制器

# support.check.controller.unavailable
source: The Controller is unavailable. Open Diagnostics for redacted details.
zh_hans: 控制器不可用。请打开“诊断”查看已脱敏详情。

# support.check.coreIntegrity.notVerified
source: Not verified
zh_hans: 未验证

# support.check.coreIntegrity.title
source: Core Integrity
zh_hans: 内核完整性

# support.check.coreUpdate.repairRequired
source: Manual repair is required before another activation.
zh_hans: 再次激活前需要手动修复。

# support.check.privileged.damaged
source: The Privileged Component is damaged and must be reinstalled.
zh_hans: 特权组件已损坏，必须重新安装。

# support.check.privileged.failed
source: The Privileged Component reported an error. Reconnect or reinstall it.
zh_hans: 特权组件报告错误。请重新连接或重新安装。

# support.check.privileged.ready
source: Registered and authenticated.
zh_hans: 已注册并通过身份验证。

# support.check.privileged.unavailable
source: Unavailable in this launch mode.
zh_hans: 此启动模式下不可用。

# support.check.process.failed
source: Mihomo stopped after an error. Open Diagnostics for redacted details.
zh_hans: Mihomo 因错误停止。请打开“诊断”查看已脱敏详情。

# support.check.process.running
source: Running
zh_hans: 运行中

# support.check.process.stopped
source: Stopped
zh_hans: 已停止

# support.check.process.title
source: Mihomo Process
zh_hans: Mihomo 进程

# support.check.process.transitioning
source: A transition is in progress.
zh_hans: 正在切换。

# support.check.provider.failed
source: Provider fetch errors are present.
zh_hans: 存在 Provider 获取错误。

# support.check.provider.healthy
source: No provider fetch error is recorded.
zh_hans: 未记录到 Provider 获取错误。

# support.check.provider.title
source: Provider Catalog
zh_hans: Provider 目录

# support.check.subscription.failed
source: One or more subscription updates failed.
zh_hans: 一个或多个订阅更新失败。

# support.check.subscription.healthy
source: No failed subscription update is recorded.
zh_hans: 未记录到失败的订阅更新。

# support.check.subscription.title
source: Subscription Updates
zh_hans: 订阅更新

# support.check.systemProxy.disabled
source: Disabled
zh_hans: 已停用

# support.check.systemProxy.enabled
source: Enabled
zh_hans: 已启用

# support.check.systemProxy.restoreRequired
source: The saved System Proxy state requires restoration.
zh_hans: 需要恢复已保存的系统代理状态。

# support.check.tun.failed
source: TUN is selected but one or more readiness checks failed.
zh_hans: 已选择 TUN，但一个或多个就绪检查失败。

# support.check.tun.notEnabled
source: Not enabled
zh_hans: 未启用

# support.check.tun.ready
source: Process, interface, and routes are ready.
zh_hans: 进程、接口和路由均已就绪。

# support.core.active
source: Active Core: %@
zh_hans: 当前 Core：%@

# support.diagnostics.run
source: Run Diagnostics
zh_hans: 运行诊断

# support.diagnostics.running
source: Running Diagnostics
zh_hans: 正在运行诊断

# support.export.description
source: The default bundle contains only versions, system summary, diagnostic states, lifecycle summaries, and stable error codes.
zh_hans: 默认支持包仅包含版本、系统摘要、诊断状态、生命周期摘要和稳定错误代码。

# support.export.includeLogs
source: Include up to 200 recent redacted app log entries
zh_hans: 包含最多 200 条最近的已脱敏应用日志

# support.export.includeReliabilityEvidence
source: Include the bounded local reliability summary
zh_hans: 包含有限的本地可靠性摘要

# support.export.prepare
source: Preview Support Bundle
zh_hans: 预览支持包

# support.export.ready
source: Bundle Ready
zh_hans: 支持包已就绪

# support.export.review.detail
source: Vela scans again before export and blocks high-risk content. The bundle is saved locally and is never uploaded automatically.
zh_hans: Vela 会在导出前再次扫描并阻止高风险内容。支持包保存在本地，绝不会自动上传。

# support.export.review.title
source: Review Before Sharing
zh_hans: 分享前检查

# support.export.section
source: Support Bundle
zh_hans: 支持包

# support.export.title
source: Export Support Bundle
zh_hans: 导出支持包

# support.footer.noUpload
source: No remote AI · No arbitrary shell · No automatic upload
zh_hans: 无远程 AI · 无任意 Shell · 无自动上传

# support.guided.open
source: Guided Support
zh_hans: 引导式支持

# support.guided.open.help
source: Run category-based diagnostics and preview a redacted support bundle
zh_hans: 按问题类别运行诊断并预览已脱敏的支持包

# support.guided.subtitle
source: Run local diagnostics, choose an allowlisted repair, and export only after preview.
zh_hans: 运行本地诊断，选择受允许列表限制的修复操作，并在预览后再导出。

# support.guided.title
source: Guided Support
zh_hans: 引导式支持

# support.preview.evidenceIncluded
source: The bounded local reliability summary is included by your choice.
zh_hans: 已按你的选择包含有限的本地可靠性摘要。

# support.preview.files
source: Included Files
zh_hans: 包含的文件

# support.preview.logsIncluded
source: Recent redacted app logs are included by your choice.
zh_hans: 已按你的选择包含最近的已脱敏应用日志。

# support.preview.noUpload
source: Saving does not upload or open a support site.
zh_hans: 保存不会上传内容，也不会打开支持网站。

# support.preview.privacy
source: Privacy
zh_hans: 隐私

# support.preview.redacted
source: Structured redaction and a second sensitive-data scan passed.
zh_hans: 结构化脱敏和第二次敏感数据扫描均已通过。

# support.preview.save
source: Save Support Bundle…
zh_hans: 保存支持包…

# support.preview.title
source: Preview Support Bundle
zh_hans: 预览支持包

# support.repair.checkAppUpdate
source: Check for App Updates
zh_hans: 检查 App 更新

# support.repair.checkCoreCatalog
source: Check Core Catalog
zh_hans: 检查 内核 目录

# support.repair.confirm.detail
source: Vela will run only the selected allowlisted action, then repeat the related local checks.
zh_hans: Vela 只会运行所选的白名单操作，然后重复相关的本地检查。

# support.repair.confirm.title
source: Apply This Repair?
zh_hans: 应用此修复？

# support.repair.reconnectPrivilegedComponent
source: Reconnect Privileged Component
zh_hans: 重新连接特权组件

# support.repair.refreshHealth
source: Refresh Health
zh_hans: 刷新健康状态

# support.repair.refreshSubscriptions
source: Refresh Subscriptions
zh_hans: 刷新订阅

# support.repair.restoreSystemProxy
source: Restore System Proxy Mode
zh_hans: 恢复系统代理模式

# support.repair.stopVelaNetworkServices
source: Stop Vela Network Services
zh_hans: 停止 Vela 网络服务

# support.repair.validateConfiguration
source: Validate Configuration
zh_hans: 验证配置

# support.repairs.subtitle
source: Only actions already implemented by Vela are available. Nothing runs without your selection.
zh_hans: 这里只提供 Vela 已实现的操作。未经你选择，不会运行任何修复。

# support.repairs.title
source: Safe Repairs
zh_hans: 安全修复

# support.results.subtitle
source: These checks run locally and do not upload data.
zh_hans: 这些检查在本地运行，不会上传数据。

# support.results.title
source: Diagnostic Results
zh_hans: 诊断结果

# support.scenes.activeFormat
source: Active Scene: %@. %@
zh_hans: 当前场景：%@。%@

# support.scenes.noActive
source: No Scene is active. Manual activation remains available.
zh_hans: 当前没有激活的场景，仍可手动激活场景。

# support.scenes.stateUnavailable
source: Scene state could not be loaded for this support check.
zh_hans: 此次支持检查无法载入场景状态。

# support.verify.resolved.detail
source: The repeated local checks no longer report a failure.
zh_hans: 重复执行的本地检查已不再报告失败。

# support.verify.resolved.title
source: Verification Passed
zh_hans: 验证通过

# support.verify.unresolved.detail
source: The repeated checks still report a failure. Review the evidence or preview a private support bundle.
zh_hans: 重复检查仍报告失败。请查看证据，或预览隐私保护的支持包。

# support.verify.unresolved.title
source: More Attention Is Needed
zh_hans: 仍需进一步处理

# tun.flow.action.close
source: Close
zh_hans: 关闭

# tun.flow.action.hide
source: Hide
zh_hans: 隐藏

# tun.flow.action.openRecovery
source: Open Recovery
zh_hans: 打开恢复

# tun.flow.current
source: Current
zh_hans: 当前

# tun.flow.disabled.componentUnavailable
source: The privileged component is unavailable.
zh_hans: 特权组件不可用。

# tun.flow.disabled.operationInProgress
source: Wait for the current operation to finish.
zh_hans: 请等待当前操作完成。

# tun.flow.disabled.prerequisites
source: Complete the required checks before enabling TUN.
zh_hans: 启用 TUN 前请完成必要检查。

# tun.flow.disabled.profileRequired
source: Select a configuration before enabling TUN.
zh_hans: 启用 TUN 前请选择配置。

# tun.flow.preflight.core
source: Mihomo Core
zh_hans: Mihomo 内核

# tun.flow.preflight.dns
source: DNS Hijack
zh_hans: DNS 劫持

# tun.flow.preflight.interface
source: Outbound Interface
zh_hans: 出站接口

# tun.flow.preflight.routes
source: Automatic Routes
zh_hans: 自动路由

# tun.flow.preflight.stack
source: Stack
zh_hans: 栈

# tun.flow.preflight.title
source: TUN Preflight
zh_hans: TUN 预检

# tun.flow.preflight.validation
source: Configuration Validation
zh_hans: 配置验证

# tun.flow.preflight.validationOnStart
source: Validated when TUN starts
zh_hans: 启动 TUN 时验证

# tun.flow.recovery.title
source: TUN Recovery
zh_hans: TUN 恢复

# tun.flow.requested
source: Requested
zh_hans: 请求

# tun.flow.running.controller
source: Controller
zh_hans: 控制器

# tun.flow.running.routes
source: Routes
zh_hans: 路由

# tun.flow.running.systemProxy
source: System Proxy
zh_hans: 系统代理

# tun.flow.setup.title
source: Set Up TUN
zh_hans: 设置 TUN

# tun.flow.status.disabled
source: Disabled
zh_hans: 已停用

# tun.flow.status.needsAttention
source: Needs Attention
zh_hans: 需要处理

# tun.flow.status.valid
source: Valid
zh_hans: 有效

# tun.flow.step.approve
source: Approve
zh_hans: 批准

# tun.flow.step.install
source: Install
zh_hans: 安装

# tun.flow.step.start
source: Start
zh_hans: 启动

# tun.flow.step.verify
source: Verify
zh_hans: 验证

# tun.flow.transaction
source: Transaction
zh_hans: 事务

# tun.flow.transition.title
source: Switching to TUN
zh_hans: 正在切换到 TUN

# tun.onboarding.action.checkPrivilegedComponent
source: Check Privileged Component
zh_hans: 检查特权组件

# tun.onboarding.action.installPrivilegedComponent
source: Install Privileged Component
zh_hans: 安装特权组件

# tun.onboarding.approval.detail
source: Approve Vela in Login Items & Extensions when macOS requires it, then let Vela verify the privileged component handshake.
zh_hans: 当 macOS 要求时，请在“登录项与扩展”中批准 Vela，然后让 Vela 验证特权组件握手。

# tun.onboarding.approval.profileRequired.detail
source: Select and validate a profile before enabling TUN.
zh_hans: 请先选择并验证配置文件，再启用 TUN。

# tun.onboarding.approval.profileRequired.title
source: Profile Required
zh_hans: 需要配置文件

# tun.onboarding.approval.title
source: Authorize and Verify
zh_hans: 授权并验证

# tun.onboarding.component.label
source: Privileged Component
zh_hans: 特权组件

# tun.onboarding.component.version
source: Privileged Component Version
zh_hans: 特权组件版本

# tun.onboarding.install.detail
source: macOS requires a narrowly scoped privileged component to create the TUN interface and apply routes. Vela itself keeps running as your user.
zh_hans: macOS 需要一个严格受限的特权组件来创建 TUN 接口并应用路由。Vela 本身仍以当前用户身份运行。

# tun.onboarding.install.feature.removable
source: Can be stopped and uninstalled from Advanced settings at any time.
zh_hans: 可随时从“高级”设置中停止和卸载。

# tun.onboarding.install.feature.transaction
source: Keeps TUN and System Proxy transitions inside the existing ownership transaction.
zh_hans: TUN 与系统代理切换沿用现有的所有权事务。

# tun.onboarding.install.feature.validated
source: Launches only Vela's bundled Mihomo with a validated TUN configuration.
zh_hans: 仅使用经过验证的 TUN 配置启动 Vela 内置的 Mihomo。

# tun.onboarding.install.securityDetail
source: The privileged component validates the caller, executable, configuration, paths, and owner lease before starting a privileged runtime. Vela never asks you to paste a terminal command or type an administrator password into the app.
zh_hans: 特权组件会在启动特权运行时前验证调用方、可执行文件、配置、路径和所有者租约。Vela 绝不会要求你粘贴终端命令或在应用中输入管理员密码。

# tun.onboarding.install.title
source: Install the Privileged Component
zh_hans: 安装特权组件

# tun.onboarding.milestone.accessibility.complete
source: Complete
zh_hans: 已完成

# tun.onboarding.milestone.accessibility.inProgress
source: In progress
zh_hans: 进行中

# tun.onboarding.milestone.accessibility.pending
source: Pending
zh_hans: 等待中

# tun.onboarding.milestone.disableSystemProxy
source: Disable System Proxy
zh_hans: 关闭系统代理

# tun.onboarding.milestone.prepareAndValidate
source: Prepare configuration and validate Mihomo
zh_hans: 准备配置并验证 Mihomo

# tun.onboarding.milestone.startPrivilegedBackend
source: Start the privileged backend
zh_hans: 启动特权后端

# tun.onboarding.milestone.stopCurrentBackend
source: Stop the current backend
zh_hans: 停止当前后端

# tun.onboarding.milestone.verifyNetwork
source: Verify TUN interface, route, and DNS
zh_hans: 验证 TUN 接口、路由和 DNS

# tun.onboarding.recovery.heading
source: TUN Needs Recovery
zh_hans: TUN 需要恢复

# tun.onboarding.recovery.helperAttention
source: Privileged Component Requires Attention
zh_hans: 特权组件需要处理

# tun.onboarding.recovery.rollback.failed
source: Rollback Also Failed
zh_hans: 回滚也失败

# tun.onboarding.recovery.rollback.failed.detail
source: Vela could not verify that the previous network backend was restored. Open Diagnostics before retrying.
zh_hans: Vela 无法确认之前的网络后端已恢复。重试前请打开“诊断”。

# tun.onboarding.recovery.rollback.notRequired
source: Rollback Not Required
zh_hans: 无需回滚

# tun.onboarding.recovery.rollback.restored
source: Restored
zh_hans: 已恢复

# tun.onboarding.recovery.runtimeError.detail
source: Vela could not complete the TUN operation. Open Diagnostics for redacted details.
zh_hans: Vela 无法完成 TUN 操作。请打开“诊断”查看已脱敏的详细信息。

# tun.onboarding.recovery.suggestedAction
source: Review Diagnostics and resolve the reported issue before retrying TUN.
zh_hans: 请先在“诊断”中查看并解决报告的问题，然后再重试 TUN。

# tun.onboarding.recovery.transitionAndRollbackFailed
source: Transition and Rollback Failed
zh_hans: 切换和回滚均失败

# tun.onboarding.recovery.transitionAndRollbackFailed.detail
source: The TUN transition and its rollback could not be verified. Open Diagnostics before trying another network change.
zh_hans: 无法验证 TUN 切换及其回滚。进行其他网络更改前请打开“诊断”。

# tun.onboarding.recovery.transitionFailed
source: Transition Failed
zh_hans: 切换失败

# tun.onboarding.recovery.transitionFailed.detail
source: The TUN transition failed and the previous backend was restored. Review Diagnostics before retrying.
zh_hans: TUN 切换失败，之前的后端已恢复。重试前请查看“诊断”。

# tun.onboarding.recovery.unverified.detail
source: Vela could not verify the privileged component or TUN runtime.
zh_hans: Vela 无法验证特权组件或 TUN 运行时。

# tun.onboarding.running.backend
source: Backend
zh_hans: 后端

# tun.onboarding.running.connected
source: Connected
zh_hans: 已连接

# tun.onboarding.running.detail
source: The privileged runtime, TUN interface, route, and DNS checks are reported from the live engine state.
zh_hans: 特权运行时、TUN 接口、路由和 DNS 检查均来自实时引擎状态。

# tun.onboarding.running.helper
source: Privileged Component
zh_hans: 特权组件

# tun.onboarding.running.interface
source: Interface
zh_hans: 接口

# tun.onboarding.running.interface.autoDetected
source: Auto-detected
zh_hans: 自动检测

# tun.onboarding.running.leaseNeedsAttention
source: Lease Needs Attention
zh_hans: 租约需要处理

# tun.onboarding.running.leaseRenewed
source: Lease Renewed
zh_hans: 租约已续期

# tun.onboarding.running.leaseValid
source: Lease Valid
zh_hans: 租约有效

# tun.onboarding.running.mode
source: Mode
zh_hans: 模式

# tun.onboarding.running.profile
source: Profile
zh_hans: 配置文件

# tun.onboarding.running.title
source: TUN Is Running
zh_hans: TUN 正在运行

# tun.onboarding.running.traffic
source: Traffic
zh_hans: 流量

# tun.onboarding.stage.approval
source: Approval
zh_hans: 批准

# tun.onboarding.stage.install
source: Install Privileged Component
zh_hans: 安装特权组件

# tun.onboarding.stage.recovery
source: Recovery
zh_hans: 恢复

# tun.onboarding.stage.running
source: TUN Running
zh_hans: TUN 运行中

# tun.onboarding.stage.starting
source: Starting TUN
zh_hans: 正在启动 TUN

# tun.onboarding.starting.detail
source: Vela reports the actual transition phase. It does not invent a completion percentage.
zh_hans: Vela 会报告实际切换阶段，不会虚构完成百分比。

# tun.onboarding.starting.rollback.detail
source: The target transition did not complete. Vela is attempting one bounded restore of the previous backend.
zh_hans: 目标切换未完成。Vela 正在尝试一次有边界的旧后端恢复。

# tun.onboarding.starting.rollback.title
source: Rolling Back
zh_hans: 正在回滚

# tun.onboarding.starting.title
source: Starting TUN
zh_hans: 正在启动 TUN

# upcoming.connections.description
source: Connections is planned for V0.2.
zh_hans: 连接功能计划在 V0.2 中提供。

# upcoming.default.description
source: This area is scheduled for a later Vela sprint.
zh_hans: 此区域计划在 Vela 后续迭代中提供。

# upcoming.scenes.description
source: Automatic scenes will become available after the configuration layer cutover is complete.
zh_hans: 配置层切换完成后，自动场景将会可用。
